{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "education",
    "1": "product_discovery",
    "2": "comparison",
    "3": "evaluation",
    "4": "deal_seeking",
    "5": "provider_selection",
    "6": "signup",
    "7": "purchase",
    "8": "booking",
    "9": "download",
    "10": "contact_sales",
    "11": "task_execution",
    "12": "onboarding_setup",
    "13": "troubleshooting",
    "14": "account_help",
    "15": "billing_help",
    "16": "follow_up",
    "17": "emotional_reflection"
  },
  "initializer_range": 0.02,
  "label2id": {
    "account_help": 14,
    "billing_help": 15,
    "booking": 8,
    "comparison": 2,
    "contact_sales": 10,
    "deal_seeking": 4,
    "download": 9,
    "education": 0,
    "emotional_reflection": 17,
    "evaluation": 3,
    "follow_up": 16,
    "onboarding_setup": 12,
    "product_discovery": 1,
    "provider_selection": 5,
    "purchase": 7,
    "signup": 6,
    "task_execution": 11,
    "troubleshooting": 13
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 30522
}
