{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Automotive > Auto Buying and Selling",
    "1": "Business and Finance > Business",
    "2": "Business and Finance > Business > Business I.T.",
    "3": "Business and Finance > Business > Marketing and Advertising",
    "4": "Business and Finance > Business > Sales",
    "5": "Business and Finance > Business > Small and Medium-sized Business",
    "6": "Business and Finance > Business > Startups",
    "7": "Careers",
    "8": "Education",
    "9": "Food & Drink > Alcoholic Beverages",
    "10": "Food & Drink > Dining Out",
    "11": "Real Estate",
    "12": "Technology & Computing > Artificial Intelligence",
    "13": "Technology & Computing > Computing > Computer Software and Applications",
    "14": "Technology & Computing > Computing > Internet",
    "15": "Travel"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Automotive > Auto Buying and Selling": 0,
    "Business and Finance > Business": 1,
    "Business and Finance > Business > Business I.T.": 2,
    "Business and Finance > Business > Marketing and Advertising": 3,
    "Business and Finance > Business > Sales": 4,
    "Business and Finance > Business > Small and Medium-sized Business": 5,
    "Business and Finance > Business > Startups": 6,
    "Careers": 7,
    "Education": 8,
    "Food & Drink > Alcoholic Beverages": 9,
    "Food & Drink > Dining Out": 10,
    "Real Estate": 11,
    "Technology & Computing > Artificial Intelligence": 12,
    "Technology & Computing > Computing > Computer Software and Applications": 13,
    "Technology & Computing > Computing > Internet": 14,
    "Travel": 15
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 30522
}
